In [1]:
import pandas as pd

df = pd.read_csv('Ejemplo_01_Titanic_Dataset.csv')

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [2]:
varianza_fare = df['Fare'].var()
print(varianza_fare)

3125.657074319579

In [3]:
varianza_fare = df['Fare'].var()
print(f'La varianza de la tariza de los pasajeros en el Titanic es : {varianza_fare:,.2f}')

La varianza de la tariza de los pasajeros en el Titanic es : 3,125.66

In [4]:
desviacion_fare = df['Fare'].std()
print(desviacion_fare)

55.907576179973844

In [5]:
desviacion_fare = df['Fare'].std()
print(f'La desviacion estandar de la tariza de los pasajeros en el Titanic es : {desviacion_fare:,.2f}')

La desviacion estandar de la tariza de los pasajeros en el Titanic es : 55.91

In [13]:
edad_max = df['Age'].max()
print(edad_max)

76.0

In [12]:
edad_min = df['Age'].min()
print(edad_min)

0.17